def main():
    alfavit ='х едчыйt127иябщ>rкфwъьлму4оп5а8'  
    key     =' ИОНАЕТРЛМЬСЗКВЫПУЯДГЖФХЮЦШЩЧЙЭъ' #' оиеантсрвмлдякпзыьучжгхфйюбцшщэъ'
    message=''
    with open("Шифрованный_текст_2", mode="r", encoding='utf-8') as r_file:
        message=r_file.read()
    #message='ЫУАЦЕПН АРЧИТОСВП ЛЖАСОЬ ОРО ЯАЯ НБН ЧИКИТЬС ЯИВЗТНЛЛО ЗИДКИРЬФС ЕН СИРМЯИ ЩГГНЯСОКЕИ ХТАЕОСМ ЯИЕГОУНЕЙОАРМЕПН УАЕЕПН ЕИ О ЕАЗТОВНТ ДЕАЦОСНРМЕИ ЫВНЕМЮОСМ ТАДВНТ ЗТИЧТАВВП ЯИСИТЫФ ДА ИУОЕ ЗТОНВ ВИЖЕИ ДАЧТЫДОСМ К ЗАВЬСМ О ОЛЗИРЕОСМ ЛЫБНЛСКЫНС ЕН ВНЕМЮН УФЖОЕП ТАДРОЦЕПХ ЫЗАЯИКБОЯИК ОЛЗИРЕОВПХ ГАШРИК ЕНЯИСИТПН ОД ЕОХ ЛИУНТЖАС ТНАРОДАЙО АРЧИТОСВИК ЮОГТИКАЕОЬ Л ЙНРМФ ЫЛРИЖЕОСМ ЖОДЕМ ЗИСНЕЙОАРМЕПВ ХАЯНТАВ ЕИ ЕО К ИУЕИШ ОД ЕОХ АРЧИТОСВ ЮОГТИКАЕОЬ ЕОЯАЯ ЕН ЛКЬДАЕ Л АРЧИТОСВИВ ЛЖАСОЬ ИЕО ТНАРОДИКАЕП ЯАЯ ИСУНРМЕПН АРЧИТОСВП О ОЛЗИРМДЫФСЛЬ ТАДУНРМЕИ'    
    message=message.replace("\n",'')
    itog = ''   
    for i in message.lower():
        tmp=alfavit.index(i)
        itog+=key[tmp]
    with open("Расшифрованный_текст_2",mode='a') as file:
        file.write(key+"\n"+alfavit+'\n\n'+"ТЕКСТ: "+itog+'\n\n\n')
    with open('Ключ_2',mode='w+') as file:
        file.write(str(dict(zip(alfavit,key))))
    
   

if __name__=="__main__":
    main()